icoach/app/controllers/clubs_controller.rb

  def index
    @clubs = Club.all
---
SELECT "clubs".* FROM "clubs"

  def new
    @user = User.find(current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def create
    @user = User.find(current_user.id)
    @club = @user.clubs.new(params[:club])
    @club.save && @club.roles.create(:user => @user, :is_admin => true)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
INSERT INTO "clubs" ("acronym", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["acronym", "CRFR"], ["created_at", Wed, 24 Oct 2012 15:09:28 UTC +00:00], ["name", "Ferreira de Aves"], ["updated_at", Wed, 24 Oct 2012 15:09:28 UTC +00:00]]
INSERT INTO "roles" ("club_id", "created_at", "is_admin", "is_coach", "is_doctor", "is_manager", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)