icoach/app/controllers/games_controller.rb

SELECT "teams".* FROM "teams" WHERE "teams"."id" = 1 LIMIT 1
---
  def index
    @team = Team.find(params[:team_id])

SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", "1"]]
---
  def new
    @game = Game.new
    @game.team = Team.find(params[:team_id])

SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", "4"]]
---
  def edit
    @game = Game.find(params[:id])

SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "games" ("at_home", "created_at", "date", "hour", "opponent", "played", "team_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @game = Game.new(params[:game])
    @game.team = Team.find(params[:team_id])
    @game.played = false

    respond_to do |format|
      if @game.save

SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "games" SET "hour" = '2000-01-01 01:24:00.000000', "updated_at" = '2012-11-01 01:12:44.717193' WHERE "games"."id" = 5
---
  def update
    @game = Game.find(params[:id])

    respond_to do |format|
      if @game.update_attributes(params[:game])

SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "games" WHERE "games"."id" = ?  [["id", 2]]
---
  def destroy
    @game = Game.find(params[:id])
    @team = @game.team
    @game.destroy