icoach/app/controllers/players_controller.rb

SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "players" ("created_at", "date_of_birth", "height", "name", "nationality", "number", "position", "team_id", "updated_at", "weight") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@team = Team.find(params[:team_id])
		@player = @team.players.create(params[:player])