icoach/app/controllers/teams_controller.rb

  def index
    @teams = Team.all
    @games = Game.all
---
SELECT "teams".* FROM "teams"
SELECT "games".* FROM "games" WHERE "games"."team_id" = 1

  def show
    @team = Team.find(params[:id])
    @club = Club.find(@team.club_id)
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT 1  [["id", 1]]

  def create
    ###TODO change this!
    club = Club.find(1)
    ######

    @team = club.teams.new(params[:team])

    respond_to do |format|
      if @team.save
---
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "teams" ("club_id", "created_at", "name", "season", "updated_at") VALUES (?, ?, ?, ?, ?)  [["club_id", 1], ["created_at", Wed, 24 Oct 2012 15:13:13 UTC +00:00], ["name", "Seniores"], ["season", "2012/2013"], ["updated_at", Wed, 24 Oct 2012 15:13:13 UTC +00:00]]