icoach/app/views/clubs/_addUsers.html.erb

    <%= hidden_field_tag "club[user_ids][]", nil %>
    <% User.all.each do |user| %>
	    <% if  @club.user_ids.include?(user.id) %>
---
SELECT "users".* FROM "users"
SELECT DISTINCT "users".id FROM "users" INNER JOIN "roles" ON "users"."id" = "roles"."user_id" WHERE "roles"."club_id" IS NULL