icoach/app/views/clubs/index.html.erb

SELECT "users".* FROM "users" INNER JOIN "roles" ON "users"."id" = "roles"."user_id" WHERE "roles"."club_id" = 1
---
    <td>
    <% club.users.each do |user| %>