icoach/app/views/clubs/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "roles" ON "users"."id" = "roles"."user_id" WHERE "roles"."club_id" = 1
SELECT "roles".* FROM "roles" WHERE "roles"."club_id" = 1 AND "roles"."user_id" = 1 LIMIT 1
---

<% @club.users.each do |user| %>
    <p><%= user.email %>
    <%= user.roles.find_all_by_club_id(@club.id) %></p>