icoach/app/views/teams/index.html.erb

SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT 1  [["id", 1]]
---
<% @teams.each do |team| %>
<% club = Club.find(team.club_id).name %>