icoach/app/views/teams/show.html.erb

SELECT "players".* FROM "players" INNER JOIN "players_teams" ON "players"."id" = "players_teams"."player_id" WHERE "players_teams"."team_id" = 1
SELECT COUNT(*) FROM "players" INNER JOIN "players_teams" ON "players"."id" = "players_teams"."player_id" WHERE "players_teams"."team_id" = 1
---
<h2>Jogadores</h2>
<% if @team.players.count == 0 %>